Repository: xcv58/MacTools
Catalog: Plugins/AutoHideMenuBar/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# action.setMode.description
source: 选择 macOS 何时自动隐藏菜单栏。
ar: اختر متى يقوم macOS بإخفاء شريط القائمة تلقائيًا.
de: Festlegen, wann macOS die Menüleiste automatisch ausblendet.
en: Choose when macOS automatically hides the menu bar.
es: Elija cuándo macOS oculta automáticamente la barra de menú.
fr: Choisissez quand macOS masque automatiquement la barre de menu.
ja: macOS がメニューバーを自動的に非表示にするタイミングを選択します。
ko: macOS가 메뉴 막대를 자동으로 숨기는 시기를 선택합니다.
pt: Escolha quando macOS oculta automaticamente a barra de menu.
ru: Выберите, когда macOS автоматически скрывает строку меню.
tr: macOS'un menü çubuğunu ne zaman otomatik gizleyeceğini seçin.
zh_hant: 選擇 macOS 何時自動隱藏選單列。

# action.setMode.title
source: 设置菜单栏显示方式
ar: ضبط إظهار شريط القوائم
de: Sichtbarkeit der Menüleiste festlegen
en: Set Menu Bar Visibility
es: Configurar la visibilidad de la barra de menús
fr: Définir la visibilité de la barre de menus
ja: メニューバーの表示設定
ko: 메뉴 막대 표시 설정
pt: Definir visibilidade da barra de menu
ru: Настроить видимость строки меню
tr: Menü Çubuğu Görünürlüğünü Ayarla
zh_hant: 設定選單列顯示方式

# error.modeVerificationRestored
source: 无法验证菜单栏设置，已恢复原来的模式。
ar: تعذر التحقق من إعداد شريط القائمة. تمت استعادة الوضع الأصلي.
de: Die Einstellung für die Menüleiste konnte nicht verifiziert werden. Der ursprüngliche Modus wurde wiederhergestellt.
en: Could not verify the menu bar setting. The original mode was restored.
es: No se pudo verificar la configuración de la barra de menú. Se restauró el modo original.
fr: Impossible de vérifier le paramètre de la barre de menus. Le mode d'origine a été restauré.
ja: メニューバーの設定を確認できませんでした。元のモードに戻りました。
ko: 메뉴 막대 설정을 확인하지 못했습니다. 원래 모드가 복원되었습니다.
pt: Não foi possível verificar a configuração da barra de menus. O modo original foi restaurado.
ru: Не удалось проверить настройку строки меню. Исходный режим был восстановлен.
tr: Menü çubuğu ayarı doğrulanamadı. Özgün mod geri yüklendi.
zh_hant: 無法驗證選單列設定，已還原原來的模式。

# error.modeVerificationUnrestored
source: 无法验证菜单栏设置，也无法完整恢复原来的模式。
ar: تعذر التحقق من إعداد شريط القائمة، وتعذرت استعادة الوضع الأصلي بالكامل.
de: Die Einstellung für die Menüleiste konnte nicht verifiziert werden, und der ursprüngliche Modus konnte nicht vollständig wiederhergestellt werden.
en: Could not verify the menu bar setting, and the original mode could not be fully restored.
es: No se pudo verificar la configuración de la barra de menú y no se pudo restaurar completamente el modo original.
fr: Impossible de vérifier les paramètres de la barre de menu et le mode d'origine n'a pas pu être entièrement restauré.
ja: メニューバーの設定を確認できず、元のモードを完全に復元できませんでした。
ko: 메뉴 막대 설정을 확인하지 못했으며, 원래 모드도 완전히 복원하지 못했습니다.
pt: Não foi possível verificar a configuração da barra de menus e o modo original não pôde ser totalmente restaurado.
ru: Не удалось проверить настройку строки меню, и исходный режим не удалось полностью восстановить.
tr: Menü çubuğu ayarı doğrulanamadı ve özgün mod tam olarak geri yüklenemedi.
zh_hant: 無法驗證選單列設定，也無法完整還原原來的模式。

# mode.always
source: 始终
ar: دائما
de: Immer
en: Always
es: Siempre
fr: Toujours
ja: 常に
ko: 항상
pt: Sempre
ru: Всегда
tr: Her Zaman
zh_hant: 總是

# mode.desktopOnly
source: 仅在桌面上
ar: على سطح المكتب فقط
de: Nur auf dem Schreibtisch
en: On Desktop Only
es: Solo en el escritorio
fr: Sur le bureau uniquement
ja: デスクトップのみ
ko: 데스크탑에서만
pt: Somente na mesa
ru: Только на рабочем столе
tr: Yalnızca Masaüstünde
zh_hant: 僅限桌面上

# mode.fullScreenOnly
source: 仅在全屏幕显示时
ar: في وضع ملء الشاشة فقط
de: Nur im Vollbildmodus
en: In Full Screen Only
es: Solo en pantalla completa
fr: En plein écran uniquement
ja: フルスクリーンのみ
ko: 전체 화면에서만
pt: Somente em tela cheia
ru: Только в полноэкранном режиме
tr: Yalnızca Tam Ekranda
zh_hant: 僅限全螢幕

# mode.never
source: 永不
ar: أبدا
de: Nie
en: Never
es: Nunca
fr: Jamais
ja: しない
ko: 안 함
pt: Nunca
ru: Никогда
tr: Asla

# parameter.mode.title
source: 显示方式
ar: الظهور
de: Sichtbarkeit
en: Visibility
es: Visibilidad
fr: Visibilité
ja: 表示方法
ko: 표시 방식
pt: Visibilidade
ru: Видимость
tr: Görünürlük
zh_hant: 顯示方式

# action.hide.title
source: 隐藏菜单栏
ar: إخفاء شريط القوائم
de: Menüleiste ausblenden
en: Hide Menu Bar
es: Ocultar la barra de menús
fr: Masquer la barre des menus
ja: メニューバーを隠す
ko: 메뉴 막대 숨기기
pt: Ocultar barra de menus
ru: Скрыть строку меню
tr: Menü Çubuğunu Gizle
zh_hant: 隱藏選單列

# action.show.title
source: 显示菜单栏
ar: إظهار شريط القوائم
de: Menüleiste einblenden
en: Show Menu Bar
es: Mostrar la barra de menús
fr: Afficher la barre des menus
ja: メニューバーを表示
ko: 메뉴 막대 보기
pt: Mostrar barra de menus
ru: Показать строку меню
tr: Menü Çubuğunu Göster
zh_hant: 顯示選單列

# metadata.title
source: 自动隐藏菜单栏
ar: إخفاء شريط القوائم تلقائيًا
de: Menüleiste automatisch ausblenden
en: Auto-Hide Menu Bar
es: Ocultar barra de menú automáticamente
fr: Masquer automatiquement la barre de menus
ja: メニュー バーを自動的に非表示にする
ko: 메뉴바 자동 숨기기
pt: Ocultar barra de menu automaticamente
ru: Автоматическое скрытие строки меню
tr: Menü Çubuğunu Otomatik Gizle
zh_hant: 自動隱藏選單列

# metadata.description
source: 自动隐藏菜单栏，提供更完整的屏幕显示空间
ar: إخفاء شريط القائمة تلقائيًا لتوفير مساحة أكبر على الشاشة.
de: Menüleiste automatisch ausblenden für mehr Platz auf dem Bildschirm.
en: Auto-hide the menu bar for more screen space.
es: Ocultar automáticamente la barra de menú para obtener más espacio en la pantalla.
fr: Masquer automatiquement la barre de menus pour plus d'espace sur l'écran.
ja: 画面スペースを増やすためにメニュー バーを自動的に非表示にします。
ko: 더 많은 화면 공간을 위해 메뉴 표시줄을 자동으로 숨깁니다.
pt: Ocultar automaticamente a barra de menu para obter mais espaço na tela.
ru: Автоматически скрыть строку меню, чтобы освободить место на экране.
tr: Daha fazla ekran alanı için menü çubuğunu otomatik gizleyin.
zh_hant: 自動隱藏選單列，提供更完整的螢幕顯示空間

# panel.subtitle.enabled
source: 已开启
ar: تشغيل
de: Ein
en: On
es: Activado
fr: Activé
ja: オン
ko: 켜기
pt: Ativado
ru: Включено
tr: Açık
zh_hant: 已開啟

# panel.subtitle.disabled
source: 已关闭
ar: إيقاف
de: Aus
en: Off
es: Desactivado
fr: Désactivé
ja: オフ
ko: 끄기
pt: Desligado
ru: Выкл.
tr: Kapalı
zh_hant: 已關閉

# error.toggleFailed
source: 切换菜单栏自动隐藏失败
ar: فشل تبديل الإخفاء التلقائي لشريط القائمة.
de: Das automatische Ausblenden der Menüleiste konnte nicht umgeschaltet werden.
en: Failed to toggle menu bar auto-hide.
es: No se pudo alternar la ocultación automática de la barra de menú.
fr: Échec du masquage automatique de la barre de menus.
ja: メニュー バーの自動非表示を切り替えることができませんでした。
ko: 메뉴 표시줄 자동 숨기기를 전환하지 못했습니다.
pt: Falha ao alternar a ocultação automática da barra de menus.
ru: Не удалось переключить автоматическое скрытие строки меню.
tr: Menü çubuğu otomatik gizleme değiştirilemedi.
zh_hant: 切換選單列自動隱藏失敗

# permission.automation.description
source: 切换菜单栏自动隐藏时需要控制系统事件。
ar: يتطلب تغيير الإخفاء التلقائي لشريط القوائم التحكم في أحداث النظام.
de: Zum Ändern des automatischen Ausblendens der Menüleiste muss „System Events“ gesteuert werden.
en: Changing menu bar auto-hide requires controlling System Events.
es: Cambiar la ocultación automática de la barra de menús requiere controlar Eventos del Sistema.
fr: Modifier le masquage automatique de la barre des menus nécessite de contrôler Événements système.
ja: メニューバーの自動的な表示／非表示を切り替えるには、「システムイベント」の制御が必要です。
ko: 메뉴 막대 자동 가리기를 변경하려면 ‘시스템 이벤트’를 제어해야 합니다.
pt: Alterar a ocultação automática da barra de menus requer o controle dos Eventos do Sistema.
ru: Для изменения автоскрытия строки меню требуется управление приложением «Системные события».
tr: Menü çubuğu otomatik gizlemeyi değiştirmek System Events'i denetlemeyi gerektirir.
zh_hant: 切換選單列自動隱藏時需要控制「系統事件」。

# permission.automation.footnote
source: macOS 会在首次使用时请求自动化授权。
ar: سيطلب macOS إذن الأتمتة عند الاستخدام للمرة الأولى.
de: macOS fragt bei der ersten Verwendung nach der Automation-Berechtigung.
en: macOS will request Automation access the first time this is used.
es: macOS solicitará acceso de automatización la primera vez que se use.
fr: macOS demandera l’autorisation d’automatisation lors de la première utilisation.
ja: 初回使用時に、macOSがオートメーションの許可を求めます。
ko: 처음 사용할 때 macOS가 자동화 권한을 요청합니다.
pt: O macOS solicitará acesso à Automação na primeira utilização.
ru: При первом использовании macOS запросит доступ к автоматизации.
tr: macOS, bu özellik ilk kez kullanıldığında Otomasyon erişimi isteyecek.
zh_hant: macOS 會在首次使用時要求自動化授權。

# permission.automation.title
source: 自动化
ar: الأتمتة
de: Automation
en: Automation
es: Automatización
fr: Automatisation
ja: オートメーション
ko: 자동화
pt: Automação
ru: Автоматизация
tr: Otomasyon
zh_hant: 自動化

# permission.automation.status
source: 按需确认
ar: تأكيد عند الاستخدام
de: Bestätigung bei Verwendung
en: Confirm on Use
es: Confirmar al usar
fr: Confirmation à l’utilisation
ja: 使用時に確認
ko: 사용 시 확인
pt: Confirmar ao usar
ru: Подтверждение при использовании
tr: Kullanırken Onayla
zh_hant: 按需確認
